Revit.Elements.WallType
A Revit WallType

Revit.Elements.WallType.#ctor(Autodesk.Revit.DB.WallType)
Construct from an existing Revit Element
type:

Revit.Elements.WallType.InitWallType(Autodesk.Revit.DB.WallType)
Initialize a WallType element
type:

Revit.Elements.WallType.InternalSetWallType(Autodesk.Revit.DB.WallType)
Set the internal Element, ElementId, and UniqueId
wallType:

Revit.Elements.WallType.ByName(System.String)
Select a walltype from the current document by name
name:
Returns:

Revit.Elements.WallType.FromExisting(Autodesk.Revit.DB.WallType,System.Boolean)
Create from an existign Revit element
wallType:
isRevitOwned:
Returns:

Revit.Elements.WallType.InternalWallType
Internal reference to the Revit Element

Revit.Elements.WallType.InternalElement
Reference to the Element

Revit.Elements.WallType.Name
Gets the name of the specified wall type